In [ ]:
#In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

# 1. Establish a connection between Python and the Sakila database.

In [244]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [245]:
password = getpass()

········

In [246]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [247]:
type(engine)

sqlalchemy.engine.base.Engine

In [248]:
data = pd.read_sql_query("SELECT *, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%m') AS month, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%Y') AS year FROM sakila.rental", engine)
#data.head()

In [249]:
data = pd.read_sql_query("SELECT *, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%m') AS month, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%Y') AS year FROM sakila.rental", engine)
#data.head() 

data[(data['month'] == '05') & (data['year'] == '2005') ]

data.drop(columns = ['month','year'], inplace = True)

# 1 Python function rentals_month

In [252]:
# Working with SQL

def rentals_monthsql(eng, month, year):

    query = "SELECT * FROM rental WHERE DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%m') = "+month+" AND DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%Y') = "+year+""
    
    df = pd.read_sql_query(query, eng)
    
    df = df.reset_index(drop = True)
    
    return df

In [253]:
#Working with Python

def rentals_monthpy(engine, month, year):

    query = "SELECT *, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%m') AS month, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%Y') AS year FROM sakila.rental"
    
    df = pd.read_sql_query(query, engine)
    
    df = df[(df['month'] == month) & (df['year'] == year) ]

    df.drop(columns = ['month','year'], inplace = True)
    
    df = df.reset_index(drop = True)
    
    return df

In [254]:
new_df = rentals_monthpy(engine, '07', '2005')

In [255]:
new_df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,3470,2005-07-05 22:49:24,883,565,2005-07-07 19:36:24,1,2006-02-15 21:30:53
1,3471,2005-07-05 22:51:44,1724,242,2005-07-13 01:38:44,2,2006-02-15 21:30:53
2,3472,2005-07-05 22:56:33,841,37,2005-07-13 17:18:33,2,2006-02-15 21:30:53
3,3473,2005-07-05 22:57:34,2735,60,2005-07-12 23:53:34,1,2006-02-15 21:30:53
4,3474,2005-07-05 22:59:53,97,594,2005-07-08 20:32:53,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
6704,10176,2005-07-31 23:40:35,1181,19,2005-08-09 00:46:35,2,2006-02-15 21:30:53
6705,10177,2005-07-31 23:42:33,2242,279,2005-08-03 01:30:33,2,2006-02-15 21:30:53
6706,10178,2005-07-31 23:43:04,1582,491,2005-08-03 00:43:04,1,2006-02-15 21:30:53
6707,10179,2005-07-31 23:49:54,2136,131,2005-08-01 20:46:54,2,2006-02-15 21:30:53
6708,10180,2005-07-31 23:57:43,757,50,2005-08-09 04:04:43,2,2006-02-15 21:30:53

# 2 Python function rental_count_month

In [256]:
def rental_count_month(df):
    
    
    test_df = df.groupby('customer_id')[['rental_id']].count()
    
    
    df['rental_date'] = df['rental_date'].astype(str)
    test_df.rename(columns = {'rental_id':"rental_"+df['rental_date'].str.split('-')[0][1]+"_"+df['rental_date'].str.split('-')[0][0]}, inplace = True)

    return test_df

In [257]:
july_count = rental_count_month(new_df)

# 3 Python function compare_rentals

In [258]:
august_count

             rental_08_2005
customer_id
1                        11
2                        11
3                         7
4                        11
5                        13
...                     ...
595                       8
596                      13
597                      12
598                       5
599                       7

[599 rows x 1 columns]

In [259]:
july_count

             rental_07_2005
customer_id
1                        12
2                        14
3                        13
4                         5
5                        16
...                     ...
595                      19
596                       6
597                       7
598                      16
599                       7

[599 rows x 1 columns]

In [260]:
august_count.join(july_count)

             rental_08_2005  rental_07_2005
customer_id
1                        11              12
2                        11              14
3                         7              13
4                        11               5
5                        13              16
...                     ...             ...
595                       8              19
596                      13               6
597                      12               7
598                       5              16
599                       7               7

[599 rows x 2 columns]

In [294]:
def compare_rentals(df1, df2):

    difference = df1.join(df2)
    
    
    list_difference = []
    
    for i in range(len(difference)):
        if difference.iloc[:,1][i+1] > difference.iloc[:,0][i+1]:
            list_difference.append(difference.iloc[:,1][i+1] - difference.iloc[:,0][i+1])
        elif difference.iloc[:,0][i+1] > difference.iloc[:,1][i+1]:
            list_difference.append(difference.iloc[:,0][i+1] - difference.iloc[:,1][i+1])
        else: list_difference.append(0)
           
    difference['difference'] = list_difference   
    
    return difference

In [295]:
difference

             rental_08_2005  rental_07_2005  difference
customer_id
1                        11              12           1
2                        11              14           3
3                         7              13           6
4                        11               5           6
5                        13              16           3
...                     ...             ...         ...
595                       8              19          11
596                      13               6           7
597                      12               7           5
598                       5              16          11
599                       7               7           0

[599 rows x 3 columns]